
&НаКлиенте
Процедура КорпусПриИзменении(Элемент)
Объект.СтоимостьПроживания = РаботаСоСправочниками.РозничнаяЦена(ТекущаяДата(),Объект.Корпус)*Объект.КоличествоМесяцев;
Объект.ОтчисленияСотруднику = Объект.СтоимостьПроживания * 0.2;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМесяцевПриИзменении(Элемент)
	Объект.СтоимостьПроживания = РаботаСоСправочниками.РозничнаяЦена(ТекущаяДата(),Объект.Корпус)*Объект.КоличествоМесяцев;	   
	Объект.ОтчисленияСотруднику = Объект.СтоимостьПроживания * 0.2;
КонецПроцедуры

&НаКлиенте
Процедура СделатьЧек(Команда) 
	ТабДок = СделатьЧек_();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция СделатьЧек_()
	ТабДок = новый ТабличныйДокумент();  	 
	 этОб = РеквизитФормыВЗначение("Объект");	Макет1 = этОб.ПолучитьМакет("Чек");
	 
	ОбластьШапка = Макет1.ПолучитьОбласть("Шапка"); 
	
	Запрос2 = новый Запрос("ВЫБРАТЬ
	                       |	Организация.Наименование КАК Наименование,
	                       |	Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	                       |	Организация.Телефон КАК Телефон,
	                       |	Организация.Почта КАК Почта,
	                       |	Организация.Сайт КАК Сайт
	                       |ИЗ
	                       |	Справочник.Организация КАК Организация");
	
	РезультатЗапроса = Запрос2.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наименование = "";    
	Адрес = "";
	Телефон = "";
	Почта = "";
	Сайт = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Наименование = ВыборкаДетальныеЗаписи.Наименование;
	  Адрес = ВыборкаДетальныеЗаписи.ЮридическийАдрес;
	  Телефон = ВыборкаДетальныеЗаписи.Телефон;
	  Почта = ВыборкаДетальныеЗаписи.Почта;
	  Сайт = ВыборкаДетальныеЗаписи.Сайт;
	  
	КонецЦикла;
	
	//Результат2 = Запрос2.Выполнить();
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименование;
	ОбластьШапка.Параметры.Адрес = Адрес;
	ОбластьШапка.Параметры.Телефон = Телефон;
	ОбластьШапка.Параметры.Почта = Почта;
	ОбластьШапка.Параметры.Сайт = Сайт;    
	
	ОбластьШапка.Параметры.МоментВремени = Объект.Дата;
	ОбластьШапка.Параметры.Сотрудник = Объект.Сотрудник;
	ОбластьШапка.Параметры.ОтчисленияСотруднику = Строка(Объект.ОтчисленияСотруднику) + " руб";
	ОбластьШапка.Параметры.Клиент = Объект.Клиент;
	ОбластьШапка.Параметры.КоличествоМесяцев = Объект.КоличествоМесяцев;
	ОбластьШапка.Параметры.Комната = Объект.Комната; 
	ОбластьШапка.Параметры.СтоимостьПроживания = Строка(Объект.СтоимостьПроживания) + " руб";     	
	 ТабДок.Вывести(ОбластьШапка);


     Возврат ТабДок;
	КонецФункции
