
&НаКлиенте
Процедура Создать(Команда)
    ТабДок = получитьОтчет();
	ТабДок.Показать();
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьОтчетЗаМесяц(Команда)
	ТабДок = получитьОтчетЗаМесяц(Объект.ДатаНачалаОтчета, Объект.ДатаОкончанияОтчета);
	ТабДок.Показать();	
КонецПроцедуры 

&НаСервере
Функция получитьОтчетЗаМесяц(ДатаНачала, ДатаОкончания)         
	Запрос1 = новый Запрос("ВЫБРАТЬ
	                       |	ОформлениеЗаявкиНаПроживание.Сотрудник КАК Сотрудник,
	                       |	ОформлениеЗаявкиНаПроживание.Клиент КАК Клиент,
	                       |	ОформлениеЗаявкиНаПроживание.КоличествоМесяцев КАК КоличествоМесяцев,
	                       |	ОформлениеЗаявкиНаПроживание.ОтчисленияСотруднику КАК ОтчисленияСотруднику,
	                       |	ОформлениеЗаявкиНаПроживание.МоментВремени КАК МоментВремени,
	                       |	ОформлениеЗаявкиНаПроживание.Комната КАК Комната,
	                       |	ОформлениеЗаявкиНаПроживание.СтоимостьПроживания КАК СтоимостьПроживания,
	                       |	Сотрудники.Должность КАК Должность
	                       |ИЗ
	                       |	Документ.ОформлениеЗаявкиНаПроживание КАК ОформлениеЗаявкиНаПроживание
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                       |		ПО ОформлениеЗаявкиНаПроживание.Сотрудник = Сотрудники.Ссылка
	                       |ГДЕ
	                       |	ОформлениеЗаявкиНаПроживание.Дата >= &Дата
	                       |	И ОформлениеЗаявкиНаПроживание.Дата <= &ДатаОкончания");   
	
	Запрос1.УстановитьПараметр("Дата",ДатаНачала); 
	Запрос1.УстановитьПараметр("ДатаОкончания",ДатаОкончания); 
	Результат = Запрос1.Выполнить().Выбрать(); 
	ТабДок = новый ТабличныйДокумент();
	Макет1 = Объект.РеквизитМакет;
	ОбластьШапка = Макет1.ПолучитьОбласть("Шапка"); 
	
	Запрос2 = новый Запрос("ВЫБРАТЬ
	                       |	Организация.Наименование КАК Наименование,
	                       |	Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	                       |	Организация.Телефон КАК Телефон,
	                       |	Организация.Почта КАК Почта,
	                       |	Организация.Сайт КАК Сайт
	                       |ИЗ
	                       |	Справочник.Организация КАК Организация");
	
	РезультатЗапроса = Запрос2.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наименование = "";    
	Адрес = "";
	Телефон = "";
	Почта = "";
	Сайт = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Наименование = ВыборкаДетальныеЗаписи.Наименование;
	  Адрес = ВыборкаДетальныеЗаписи.ЮридическийАдрес;
	  Телефон = ВыборкаДетальныеЗаписи.Телефон;
	  Почта = ВыборкаДетальныеЗаписи.Почта;
	  Сайт = ВыборкаДетальныеЗаписи.Сайт;
	  
	КонецЦикла;
	
	//Результат2 = Запрос2.Выполнить();
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименование;
	ОбластьШапка.Параметры.Адрес = Адрес;
	ОбластьШапка.Параметры.Телефон = Телефон;
	ОбластьШапка.Параметры.Почта = Почта;
	ОбластьШапка.Параметры.Сайт = Сайт;
	
    ТабДок.Вывести(ОбластьШапка);
	
	
	Прибыль = 0;                     	
	Пока Результат.Следующий() Цикл 
	ОбластьПараметры = Макет1.ПолучитьОбласть("Параметры");   
	ЗаполнитьЗначенияСвойств(ОбластьПараметры.Параметры,Результат);
	Прибыль = Прибыль + Результат.СтоимостьПроживания;
	ТабДок.Вывести(ОбластьПараметры);	
	КонецЦикла;           

	ОбластьПодвал = Макет1.ПолучитьОбласть("Подвал"); 
	ОбластьПодвал.Параметры.Прибыль = Прибыль;
	ТабДок.Вывести(ОбластьПодвал);	
	
	Возврат ТабДок;	
КонецФункции
Функция получитьОтчет()
	  Запрос1 = новый Запрос("ВЫБРАТЬ
	                         |	ОформлениеЗаявкиНаПроживание.Сотрудник КАК Сотрудник,
	                         |	ОформлениеЗаявкиНаПроживание.Клиент КАК Клиент,
	                         |	ОформлениеЗаявкиНаПроживание.КоличествоМесяцев КАК КоличествоМесяцев,
	                         |	ОформлениеЗаявкиНаПроживание.ОтчисленияСотруднику КАК ОтчисленияСотруднику,
	                         |	ОформлениеЗаявкиНаПроживание.МоментВремени КАК МоментВремени,
	                         |	ОформлениеЗаявкиНаПроживание.Комната КАК Комната,
	                         |	ОформлениеЗаявкиНаПроживание.СтоимостьПроживания КАК СтоимостьПроживания,
	                         |	Сотрудники.Должность КАК Должность
	                         |ИЗ
	                         |	Документ.ОформлениеЗаявкиНаПроживание КАК ОформлениеЗаявкиНаПроживание
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                         |		ПО ОформлениеЗаявкиНаПроживание.Сотрудник = Сотрудники.Ссылка");
	
	Результат = Запрос1.Выполнить().Выбрать(); 
	ТабДок = новый ТабличныйДокумент();
	Макет1 = Объект.РеквизитМакет;
	ОбластьШапка = Макет1.ПолучитьОбласть("Шапка"); 
	
	Запрос2 = новый Запрос("ВЫБРАТЬ
	                       |	Организация.Наименование КАК Наименование,
	                       |	Организация.ЮридическийАдрес КАК ЮридическийАдрес,
	                       |	Организация.Телефон КАК Телефон,
	                       |	Организация.Почта КАК Почта,
	                       |	Организация.Сайт КАК Сайт
	                       |ИЗ
	                       |	Справочник.Организация КАК Организация");
	
	РезультатЗапроса = Запрос2.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наименование = "";    
	Адрес = "";
	Телефон = "";
	Почта = "";
	Сайт = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	  Наименование = ВыборкаДетальныеЗаписи.Наименование;
	  Адрес = ВыборкаДетальныеЗаписи.ЮридическийАдрес;
	  Телефон = ВыборкаДетальныеЗаписи.Телефон;
	  Почта = ВыборкаДетальныеЗаписи.Почта;
	  Сайт = ВыборкаДетальныеЗаписи.Сайт;
	  
	КонецЦикла;
	
	//Результат2 = Запрос2.Выполнить();
	ОбластьШапка.Параметры.НазваниеОрганизации = Наименование;
	ОбластьШапка.Параметры.Адрес = Адрес;
	ОбластьШапка.Параметры.Телефон = Телефон;
	ОбластьШапка.Параметры.Почта = Почта;
	ОбластьШапка.Параметры.Сайт = Сайт;
	
    ТабДок.Вывести(ОбластьШапка);
	
	
	Прибыль = 0;                     	
	Пока Результат.Следующий() Цикл 
	ОбластьПараметры = Макет1.ПолучитьОбласть("Параметры");   
	ЗаполнитьЗначенияСвойств(ОбластьПараметры.Параметры,Результат);
	Прибыль = Прибыль + Результат.СтоимостьПроживания;
	ТабДок.Вывести(ОбластьПараметры);	
	КонецЦикла;           

	ОбластьПодвал = Макет1.ПолучитьОбласть("Подвал"); 
	ОбластьПодвал.Параметры.Прибыль = Прибыль;
	ТабДок.Вывести(ОбластьПодвал);	
	
	Возврат ТабДок;
	КонецФункции   





