
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСхемуЗалаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРядовПриИзменении(Элемент)
	ОбновитьСхемуЗалаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	ОбновитьСхемуЗалаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСхемуЗалаНаСервере()     
	Объект.КоличествоРядов = 2;
	Комнаты = 1;
	Если Объект.КоличествоРядов = 0 ИЛИ Объект.КоличествоКомнат = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок.Очистить();
	Макет = ПолучитьОбщийМакет("СхемаЗала");
	
	ОблНачалоРядНачало = Макет.ПолучитьОбласть("Начало|РядНачало");
	ОблНачалоМесто     = Макет.ПолучитьОбласть("Начало|Место");
	ОблНачалоОтступ    = Макет.ПолучитьОбласть("Начало|Отступ");
	ОблНачалоРядКонец  = Макет.ПолучитьОбласть("Начало|РядКонец");

	ОблКонецРядНачало = Макет.ПолучитьОбласть("Конец|РядНачало");
	ОблКонецМесто     = Макет.ПолучитьОбласть("Конец|Место");
	ОблКонецОтступ    = Макет.ПолучитьОбласть("Конец|Отступ");
	ОблКонецРядКонец  = Макет.ПолучитьОбласть("Конец|РядКонец");
	
	ОблСтрокаРядНачало = Макет.ПолучитьОбласть("Строка|РядНачало");
	ОблСтрокаРядКонец  = Макет.ПолучитьОбласть("Строка|РядКонец");
	ОблСтрокаОтступ    = Макет.ПолучитьОбласть("Строка|Отступ");
	ОблСтрокаМесто     = Макет.ПолучитьОбласть("Строка|Место");
	
	ТабДок.Вывести(ОблНачалоРядНачало);
	ТабДок.Присоединить(ОблНачалоОтступ);	
	Для ТекМесто = 1 По Объект.КоличествоКомнат Цикл
		ТабДок.Присоединить(ОблНачалоМесто);	
		ТабДок.Присоединить(ОблНачалоОтступ);	
	КонецЦикла;
	ТабДок.Присоединить(ОблНачалоРядКонец);	
	
	Для ТекРяд = 1 По Объект.КоличествоРядов Цикл
		ОблСтрокаРядНачало.Параметры.Ряд = "";
	    ТабДок.Вывести(ОблСтрокаРядНачало);
		
		Для ТекМесто = 1 По Объект.КоличествоКомнат Цикл
			ТабДок.Присоединить(ОблСтрокаОтступ);	
			ОблСтрокаМесто.Параметры.Место = Комнаты;
		    ТабДок.Присоединить(ОблСтрокаМесто);
			Комнаты = Комнаты + 1; 
		КонецЦикла;
		ТабДок.Присоединить(ОблСтрокаОтступ);	
		ОблСтрокаРядКонец.Параметры.Ряд = "";
		ТабДок.Присоединить(ОблСтрокаРядКонец);
	КонецЦикла;
	
	ТабДок.Вывести(ОблКонецРядНачало);
	ТабДок.Присоединить(ОблКонецОтступ);	
	Для ТекМесто = 1 По Объект.КоличествоКомнат Цикл
		ТабДок.Присоединить(ОблКонецМесто);	
		ТабДок.Присоединить(ОблКонецОтступ);	
	КонецЦикла;
	ТабДок.Присоединить(ОблКонецРядКонец);	
	
КонецПроцедуры


